<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="css/style.css">
    <title>Practice 8</title>
</head>
<body>
<button class="knopa"><a href="index.php">Меню</a></button>
<h2 class="ver">Superglobals в PHP</h2>
<table>
  <tr>
    <th>Суперглобальні змінні PHP</th>
    <th>Характеристика</th>
  </tr>
  <tr>
    <td>$GLOBALS</td>
    <td>Асоціативний масив, що містить посилання на всі змінні, які наразі визначені в глобальній області видимості скрипта. Імена змінних є ключами масиву. </td>
  </tr>
  <tr>
    <td>$_SERVER</td>
    <td>Асоціативний масив, що містить таку інформацію, як заголовки, шляхи та розташування скриптів. Записи в цьому масиві створюються веб-сервером, тому немає гарантії, що кожен веб-сервер надасть будь-яку з цих даних.</td>
  </tr>
  <tr>
    <td>$_GET</td>
    <td>Асоціативний масив змінних, переданих поточному скрипту через параметри URL (так званий рядок запиту).</td>
  </tr>
  <tr>
    <td>$_POST</td>
    <td>Асоціативний масив змінних, переданий поточному скрипту методом HTTP POST, якщо в якості HTTP Content-Type в запиті використовується application/x-www-form-urlencoded або multipart/form-data. </td>
  </tr>
  <tr>
    <td>$_FILES</td>
    <td>Асоціативний масив елементів, що завантажуються в поточний скрипт сервера за допомогою методу HTTP POST. </td>
  </tr>
  <tr>
    <td>$_REQUEST</td>
    <td>Асоціативний масив, який за замовчуванням містить вміст $_GET, $_POST та $_COOKIE.</td>
  </tr>
  <tr>
    <td>$_SESSION</td>
    <td>Асоціативний масив, що містить змінні сеансу, доступні поточному скрипту.</td>
  </tr>
  <tr>
    <td>$_ENV</td>
    <td> Асоціативний масив змінних, переданий поточному скрипту через метод оточення. Ці змінні імпортуються до глобального простору імен PHP з середовища, у якому запущено синтаксичний аналізатор PHP. </td>
  </tr>
  <tr>
    <td>$_COOKIE</td>
    <td>Асоціативний масив змінних, переданий поточному скрипту через HTTP Cookies.</td>
  </tr>
</table>

</html>